app/controllers/campaigns_controller.rb

  def index
    if params[:view_option]
      case params[:view_option].to_i
        when 2 then @campaigns = Campaign.find(:all, :order => "updated_at ASC")
        when 3 then @campaigns = Campaign.find(:all, :order => "created_at ASC")
        when 4 then @campaigns = Campaign.find(:all, :order => "name ASC")
        when 5 then
          if ids = session[:recent_campaigns]
            @campaigns = Campaign.find(ids)
            @campaigns = ids.map {|id| @campaigns.detect {|x| x.id == id}}
---
SELECT * FROM "campaigns" WHERE ("campaigns"."id" IN (1,2))
SELECT * FROM "campaigns" ORDER BY updated_at ASC

  def show
    @campaign = Campaign.find(params[:id])
---
SELECT * FROM "campaigns" WHERE ("campaigns"."id" = 1)

  def new
    @campaign = Campaign.new
    @statuses, @types, @owners = prepare_options_for_select(Status.all, Type.all, User.all)
---
SELECT * FROM "statuses"
SELECT * FROM "types"
SELECT * FROM "users"

  def edit
    @campaign = Campaign.find(params[:id])
    @statuses, @types = prepare_options_for_select(Status.all, Type.all)
---
SELECT * FROM "campaigns" WHERE ("campaigns"."id" = 1)
SELECT * FROM "statuses"
SELECT * FROM "types"

  def update
    options = params[:campaign]
    @campaign = Campaign.find(params[:id])
---
SELECT * FROM "campaigns" WHERE ("campaigns"."id" = 1)

  def destroy
    @campaign = Campaign.find(params[:id])
    @campaign.destroy
---
SELECT * FROM "campaigns" WHERE ("campaigns"."id" = 3)
DELETE FROM "campaigns" WHERE "id" = 3